app/views/trips/index.html.erb

SELECT "mates".* FROM "mates" INNER JOIN "enrollments" ON "mates"."id" = "enrollments"."mate_id" WHERE "enrollments"."trip_id" = $1  [["trip_id", 1]]
---
                <p><%= trip.start_date.strftime("%a, %d %b %Y") %> → <%= trip.end_date.strftime("%a, %d %b %Y") %></p>
                <% trip.mates.length == 1 ? word = "mate" : word = "mates" %>