app/views/trips/index.html.erb

      <!-- Define skipper if any -->
      <% skipper = trip.skipper.mates.where("is_user = true").first unless trip.skipper == nil %>
---
SELECT "mates".* FROM "mates" INNER JOIN "enrollments" ON "mates"."id" = "enrollments"."mate_id" WHERE "enrollments"."trip_id" = $1  [["trip_id", 2]]

              <% unless trip.mates == nil %>
                <% count = trip.mates.length %>
---
SELECT "mates".* FROM "mates" INNER JOIN "enrollments" ON "mates"."id" = "enrollments"."mate_id" WHERE "enrollments"."trip_id" = $1  [["trip_id", 1]]