app/controllers/mates_controller.rb

  def index
    @user = current_user
    @mates = @user.mates.select { |mate| mate.is_user == false }.sort { |m1, m2| m2.updated_at <=> m1.updated_at }
---
SELECT "mates".* FROM "mates" WHERE "mates"."user_id" = $1  [["user_id", 1]]

  def create
    @mate = Mate.new(mate_params)
    @user = current_user
    @mate.user = current_user
    if @mate.save
---
INSERT INTO "mates" ("user_id", "is_user", "first_name", "last_name", "date_of_birth", "phone_number", "address", "nationality", "country_of_residence", "passport_number", "expiration_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def destroy
    @user = current_user
    set_mate
    @mate.destroy
---
DELETE FROM "mates" WHERE "mates"."id" = $1  [["id", 11]]

  def set_mate
    @mate = Mate.find(params[:id])
---
SELECT "mates".* FROM "mates" WHERE "mates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]