app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips" WHERE "trips"."creator_id" = $1  [["creator_id", 3]]
---
  def show
    @invited_users = "x"
    @enrollment = Enrollment.new
    @user = current_user
    @ur_trips = Trip.all.select { |t| t.creator_id == @user.id }