app/controllers/trips_controller.rb

  def index
    @user = current_user
    @trips = @user.created_trips
    @all_trips = []
    @invitation = Invitation.new
    # Add all the trips where the user was invited by someone else.
    @user.invitations_received.each do |invitation|
---
SELECT "invitations".* FROM "invitations" ORDER BY "invitations"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def show
    set_trip
    @invited_users = Invitation.where("trip_id = ? AND receiver_id IS NOT null", @trip.id).pluck(:receiver_id)
    @skipper = @trip.skipper.mates.where("is_user = true").first unless @trip.skipper == nil
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_trip
    @trip = Trip.find(params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]