app/controllers/users_controller.rb

  def update
    redirect_page = params[:user][:redirect_page]
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2022-11-30 11:11:04.184338"], ["id", 1]]